# vim: set ft=ruby

brew 'git'
brew 'zsh'
brew 'bash'
brew 'make'
brew 'cmake'
brew 'openssl'
brew 'coreutils'
brew 'gnu-tar'
brew 'fzf'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'ripgrep'
brew 'direnv'
brew 'ffmpeg'
brew 'wget'
brew 'curl'
brew 'gnu-sed'
brew 'z'
brew 'cloc'
brew 'jq'
brew 'tree'
brew 'gh'
brew 'sqlite3'
brew 'pandoc'
brew 'gnupg'
brew 'graphviz'
brew 'gcc'
brew 'moreutils'
brew 'watch'
brew 'shellcheck'
brew 'shfmt'
brew 'pgrep'
brew 'pkill'
brew 'neovim'
brew 'atuin'
brew 'btop'
brew 'neofetch'

brew 'livekit'
brew 'foreman'

cask 'keepingyouawake'
cask 'rectangle'
cask 'istat-menus'
cask 'vlc'
cask 'visual-studio-code'
cask 'postico'
cask 'cleanshot'
cask 'screenflow'
cask 'obs'
cask 'imageoptim'

# terminal emulators
cask 'wezterm'

tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'
